In [ ]:
# !pip install pandas
import pandas as pd
import numpy as np

> Whenever we read some data from a file it converted in a *Data Structure* named **DataFrame** by default

In [ ]:
np.arange(0,20).reshape(5,4)

In [ ]:
df=pd.DataFrame(
    data=np.arange(0,20).reshape(5,4),
    index=["R1","R2","R3","R4","R5"],
    columns=["C1","C2","C3","C4"]
)
df

In [ ]:
df.head(2)

In [ ]:
df.tail(2)

In [18]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, R1 to R5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      5 non-null      int32
 1   C2      5 non-null      int32
 2   C3      5 non-null      int32
 3   C4      5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [22]:
df.describe()

              C1         C2         C3         C4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

## Indexing
   1. columnname,
   1. rowindex[Loc]
   1. rowindex no columnindex no[.iloc] index location

In [24]:
df

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

### Data Retrival

In [41]:
# Type 1.

df['C1']
# type(df['C1'])

R1     0
R2     4
R3     8
R4    12
R5    16
Name: C1, dtype: int32

In [50]:
# Type 2.

df.loc['R1']
df.loc[['R1','R2']]
# type(df.loc['R1'])
# type(df.loc[['R1','R2']])

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7

In [52]:
df

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [91]:
# Type 3

#       Row Col
df.iloc[2:4,1:4]

    C2  C3  C4
R3   9  10  11
R4  13  14  15

In [103]:
df.iloc[:,0:4:3]

    C1  C4
R1   0   3
R2   4   7
R3   8  11
R4  12  15
R5  16  19

In [112]:
# Convert Data Frames into an Array

df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

## Basic Operations

In [114]:
df.isnull().sum()

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [116]:
df1=pd.DataFrame(
    data=[[1,np.nan,1],[1,2,3]],
    index=["R1","R2"],
    columns=["C1","C2","C3"]
)
df1

    C1   C2  C3
R1   1  NaN   1
R2   1  2.0   3

In [118]:
df1.isnull().sum()

C1    0
C2    1
C3    0
dtype: int64

In [120]:
df1.isnull()

       C1     C2     C3
R1  False   True  False
R2  False  False  False

In [125]:
# df1.isnull().sum()==0
df1.isnull().sum()==1

C1    False
C2     True
C3    False
dtype: bool

In [130]:
df1

    C1   C2  C3
R1   1  NaN   1
R2   1  2.0   3

In [129]:
df1['C3'].value_counts() # value_counts means how many numbers are there like here 1 1 and 1 3 is there

1    1
3    1
Name: C3, dtype: int64

In [135]:
# Unique val on Column 2

df1['C2'].unique()
df1['C1'].unique()

array([1], dtype=int64)

In [137]:
df1>0.1

      C1     C2    C3
R1  True  False  True
R2  True   True  True

In [146]:
# df1[df1['C1']>0.1]
df1[df1['C2']>0.1]

    C1   C2  C3
R2   1  2.0   3